const UPDATE_OFFERS = 'UPDATE_OFFERS'

const initialState = {
    offerItems: [
        {   
            id: 1,
            title: 'Тимчасовий побит',
            photo: 'img/pobyt.jpeg',
            offers: [
                {title: 'повний супровід', deskription: 'допомога в отриманні внж до самого отримання пластіку'},
                {title: 'подача на карту', deskription: 'допомога в отриманні всіх документів та подача з нашим працівником.'},
                {title: 'реєстрація на отримання пластіку', deskription: 'реєстрація та отримання карти разом з нашим працівником'},
                {title: 'прискорення справи', deskription: 'допомога у разі проблем з отриманням внж(довгий період перегляду справи, зміна даних і тд.)'},
            ],
            deskription: 'Карта побиту. Це документ, що підтверджує особу та офіційний статус (тимчасовий або сталий) на території  Польщі. Карта побиту дає можливість легально знаходитись на території Польщі та зоні ЄС без оформлення та продовження візи. Дозвіл на перебування дозволяє його власнику - відкривати бізнес, оформлювати кредит та іпотеку, реєструвати на своє ім’я авто чи нерухомість. В залежності від типу, дозвіл на перебування іноземця оформлюється строком: до 3-х років (тимчасовий) та до 10-ти років (сталий побит, карта резидента).',
            questionFirst: 'Що дає тимчасовий побут?',
            answerFirst: "Дає право безперервно перебувати в країні і офіційно працювати строком від  1 до  3 років (в залежності від терміну виданого рішення). Видається на підставі робочого контракту, навчання чи возз'єднання з родиною",
            questionSecond: 'Як відбувається процес отримання дозволу на проживання за допомогою нашої фірми?',
            answerSecond: 'Безкоштовна консультація. Ви - задаєте всі питання, які вас турбують, ми - надаємо професійну оцінку вашій ситуації. Заключення контракту. Прозорий та покроковий план дій для кожного з клієнтів. Оплата. Після підписання контракту - ваш менеджер видає вам підтвердження оплати. Подача документів до органів місцевого самоврядування. Отримання децизії. Отримання пластикової ID карти. Наш менеджер зареєструє для вас зручний час, для отримання вашої карти побуту',
            questionThird: 'za co panie Vladyslawie mam jeszcze zaplacic?',
            answerThird: 'lorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit amet',
        },
        {
            id: 2,
            title: 'Тимчасовий побит УКР',
            photo: 'img/pobyt.jpeg',
            offers: [
                {title: 'повний супровід', deskription: 'допомога в отриманні внж до самого отримання пластіку'},
                {title: 'подача на карту', deskription: 'допомога в отриманні всіх документів та подача з нашим працівником.'},
                {title: 'реєстрація на отримання пластіку', deskription: 'реєстрація та отримання карти разом з нашим працівником'},
                {title: 'прискорення справи', deskription: 'допомога у разі проблем з отриманням внж(довгий період перегляду справи, зміна даних і тд.)'},
            ],
            deskription: 'Це документ, що підтверджує особливий статус іноземного громадянина в Польщі і дозволяє перебувати в країні довше, ніж за візами. Це вид на проживання, який дозволяє без оформлення віз перетинати кордон Польщі скільки завгодно раз, працювати і вчитися без додаткових дозволів.',
            questionFirst: 'Що дає тимчасовий побут UKR?',
            answerFirst: 'Тимчасовий побут для іноземців із статусом UKR. Дає право подати заявку на тимчасовий побут для іноземців, котрі офіційно працевлаштовані, виконують на території Польщі висококваліфіковану роботу чи ведуть підприємницьку діяльність',
            questionSecond: 'Як відбувається процес отримання дозволу на проживання за допомогою нашої фірми?',
            answerSecond: 'Безкоштовна консультація. Ви - задаєте всі питання, які вас турбують, ми - надаємо професійну оцінку вашій ситуації. Заключення контракту. Прозорий та покроковий план дій для кожного з клієнтів. Оплата. Після підписання контракту - ваш менеджер видає вам підтвердження оплати. Подача документів до органів місцевого самоврядування. Отримання децизії. Отримання пластикової ID карти. Наш менеджер зареєструє для вас зручний час, для отримання вашої карти побуту',
            questionThird: 'za co panie Vladyslawie mam jeszcze zaplacic?',
            answerThird: 'lorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit amet',
        },
        {   
            id: 3,
            title: 'Сталий побит',
            photo: 'img/pobyt.jpeg',
            offers: [
                {title: 'повний супровід', deskription: 'допомога в отриманні внж до самого отримання пластіку'},
                {title: 'подача на карту', deskription: 'допомога в отриманні всіх документів та подача з нашим працівником.'},
                {title: 'реєстрація на отримання пластіку', deskription: 'реєстрація та отримання карти разом з нашим працівником'},
                {title: 'прискорення справи', deskription: 'допомога у разі проблем з отриманням внж(довгий період перегляду справи, зміна даних і тд.)'},
            ],
            deskription: 'Це документ, що підтверджує особливий статус іноземного громадянина в Польщі і дозволяє перебувати в країні довше, ніж за візами. Це вид на проживання, який дозволяє без оформлення віз перетинати кордон Польщі скільки завгодно раз, працювати і вчитися без додаткових дозволів.',
            questionFirst: 'Що дає сталий побит?',
            answerFirst: 'Сталий побут. Документ, що підтверджує постійне місце проживання на території РП. Термін дії - 10 років. Видається на підставі польського походження (Карти Поляка) або 5 років безперервного проживання з картою czasowego pobytu',
            questionSecond: 'Як відбувається процес отримання дозволу на проживання за допомогою нашої фірми?',
            answerSecond: 'Безкоштовна консультація. Ви - задаєте всі питання, які вас турбують, ми - надаємо професійну оцінку вашій ситуації. Заключення контракту. Прозорий та покроковий план дій для кожного з клієнтів. Оплата. Після підписання контракту - ваш менеджер видає вам підтвердження оплати. Подача документів до органів місцевого самоврядування. Отримання децизії. Отримання пластикової ID карти. Наш менеджер зареєструє для вас зручний час, для отримання вашої карти побуту',
            questionThird: 'za co panie Vladyslawie mam jeszcze zaplacic?',
            answerThird: 'lorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit amet',
        },
        {   
            id: 4,
            title: 'Карта резидента',
            photo: 'img/pobyt.jpeg',
            offers: [
                {title: 'повний супровід', deskription: 'допомога в отриманні внж до самого отримання пластіку'},
                {title: 'подача на карту', deskription: 'допомога в отриманні всіх документів та подача з нашим працівником.'},
                {title: 'реєстрація на отримання пластіку', deskription: 'реєстрація та отримання карти разом з нашим працівником'},
                {title: 'прискорення справи', deskription: 'допомога у разі проблем з отриманням внж(довгий період перегляду справи, зміна даних і тд.)'},
            ],
            deskription: 'Це документ, що підтверджує особливий статус іноземного громадянина в Польщі і дозволяє перебувати в країні довше, ніж за візами. Це вид на проживання, який дозволяє без оформлення віз перетинати кордон Польщі скільки завгодно раз, працювати і вчитися без додаткових дозволів.',
            questionFirst: 'Що дає карта резидента?',
            answerFirst: 'Карта резидента. Видається строком на 5 років. Даний документ може отримати іноземець, який легально та безперервно проживає на території Польщі протягом останніх 5 років і може підтвердити наявність постійного джерела доходу протягом останніх 3 років',
            questionSecond: 'Як відбувається процес отримання дозволу на проживання за допомогою нашої фірми?',
            answerSecond: 'Безкоштовна консультація. Ви - задаєте всі питання, які вас турбують, ми - надаємо професійну оцінку вашій ситуації. Заключення контракту. Прозорий та покроковий план дій для кожного з клієнтів. Оплата. Після підписання контракту - ваш менеджер видає вам підтвердження оплати. Подача документів до органів місцевого самоврядування. Отримання децизії. Отримання пластикової ID карти. Наш менеджер зареєструє для вас зручний час, для отримання вашої карти побуту',
            questionThird: 'za co panie Vladyslawie mam jeszcze zaplacic?',
            answerThird: 'lorem ipsut dolor sit amet lorem ipsut dolor sit amet lorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit ametlorem ipsut dolor sit amet'
        },
        {
            id: 5,
            title: 'Бізнес',
            photo: 'img/analiz.jpeg',
            offers: [
                {title: 'Відкриття ФОП (JDG)', deskription: 'Це польський еквівалент способу ведення бізнесу як фізична особа-підприємець (ФОП). Ця форма ведення бізнесу в Польщі доступна не лише польським громадянам, а й деяким іноземцям, що мешкають у Польщі. За детальною інформацією звертайтесь до наших менеджерів. '},
                {title: 'Відкриття ТОВ (spółka)', deskription: "Для того, щоб відкрити ТОВ у Польщі, не потрібно, щоб один з його співвласників мав польське громадянство. Ви, як іноземець, маєте повне право на володіння і самостійне управління ТОВ в Польщі. Для комфортного відкриття бізнесу в Польщі - скористайтесь послугами нашої компанії і забудьте про всі можливі проблеми чи питання, які можуть у вас виникнути в процесі реєстрації своєї діяльності. "},
                {title: 'Аналіз справи', deskription: "Професійна оцінка персональним менеджером вашої заявки пов'язаної з бізнесом в Польщі."},
                {title: "Отримання спадщини", deskription: 'Допомога в оформленні заяви про прийняття спадщини за місцем відкриття спадщини.'},
            ],
            deskription: 'Наша фірма є провідним постачальником правних послуг, яка надає комплексні рішення у сфері юридичної практики. Ми зрозуміли, що однією з найважливіших складових нашого бізнесу є надання високоякісних послуг з аналізу правових справ.',
            questionFirst: 'Чи можу я вести бізнес?',
            answerFirst: "Ви можете вести бізнес у Польщі, навіть якщо у вас немає польського громадянства. Наші спеціалісти допоможуть Вам, в якій формі це робити і що знадобиться для реєстрації компанії.",
            questionSecond: 'Чи можу я бути спокійним?',
            answerSecond: "Наша команда юристів складається з висококваліфікованих фахівців з різних галузей права, які мають значний досвід у роботі з клієнтами з різних галузей бізнесу. Ми прагнемо забезпечити нашим клієнтам не лише ефективні рішення, але і сприятливу атмосферу для співпраці.",
        },
        {   
            id: 6,
            title: 'Громадянство',
            photo: 'img/passport.jpeg',
            deskription: "Громадя́нство — юридично визначений, стійкий, необмежений у просторі правовий зв'язок між особою і певною державою, що визначає їхні права та обов'язки .",
            questionFirst: 'Як відбувається получення громадянства?',
            answerFirst: "Надання польського громадянства відбувається за заявою, яка подається Президенту через Воєводу за місцем проживання зацікавленої особи. Якщо іноземець перебуває за кордоном, заява подається у консула за місцем проживання. Обов'язкова умова – заявник повинен мати пластикову картку посвідки на проживання в Польщі.",
            questionSecond: 'Яка ваша роль?',
            answerSecond: 'Супровід до отримання децизії. Підготовка повного пакету документів та консультаційна підтримка і супровід на всіх етапах, починаючи з моменту підготовки документів, подачі і до самого отримання громадянства.',
        },
        {   
            id: 7,
            title: 'Права на водіння',
            photo: 'img/auto.jpg',
            deskription: 'Це документ, що підтверджує особливий статус іноземного громадянина в Польщі і дозволяє перебувати в країні довше, ніж за візами. Це вид на проживання, який дозволяє без оформлення віз перетинати кордон Польщі скільки завгодно раз, працювати і вчитися без додаткових дозволів.',
            questionFirst: 'Чи займатесь ви заміною українських прав на польські? І як тоді це відбувається?',
            answerFirst: 'Так! Для цього потрібно прийти до нас в офіс, де ви отримаєте коротку консультацію за вашою справою. Після підписання договору вашою справою повністю займаємось ми. Вам залишається тільки очікувати на підтвердження готовності пластикуб після чого наш працівник разом з вами відправиться до уженду на його отримання.',
            questionSecond: 'Чи займаєтесь ви заміною на нове УКРАЇНСЬКЕ посвідчення?',
            answerSecond: 'Нажаль поки ні, але ось кілька порад по отриманнюю. Обмін українських посвідчень водія у Польщі. Громадяни України можуть обміняти свої водійські посвідчення у чотирьох містах Польщі: Варшаві, Кракові, Вроцлаві та Гданську. Кому потрібно замінювати водійське посвідчення? Процедура необхідна тим, у кого зіпсувалось посвідчення, закінчився термін дії документа або при зміні персональних даних. Процедура оформлення: за попереднім записом через електронну чергу; в порядку «живої» черги – талон можна отримати безпосередньо у сервісному центрі.',
        },
        {
            id: 8,
            title: 'Реєстрація авто',
            photo: 'img/auto.jpg',
            deskription: 'Реєстрація авто - це процес офіційної реєстрації транспортного засобу відповідно до законодавства країни. Це означає, що автомобіль отримує свій унікальний номер, який фіксується в державних базах даних, а також номерні знаки, що підтверджують його реєстрацію.',
            questionSecond: 'Я придбав автомобіль. Необхідно провести реєстрацію. Як це зробити?',
            answerSecond: "Крок 1. Звернутись до спеціалістів Атлантіс. Наша команда в найкоротший зі всіх можливих термінів допоможе Вам поставити на облік Ваш транспортний засіб. Крок 2. Пишемо Wniosek na rejestrację pojazdu. Наші спеціалісти за Вас заповнять всі документи, які необхідні для правильної реєстрації Вашого транспортного засобу. Ваша участь в даному процесі - зводиться до мінімуму; Крок 3. Віддаємо заяву на розгляд. Наші спеціалісти передають вашу заяву разом з необхідними документами на розгляд вашої заявки по реєстрації вашого транспортного засобу. Крок 4. Сплачуємо акцизи та збори. Крок 5. Чекаємо на рішення за вашою заявкою. Реєстрація вашого транспортного засобу може проводитися прямо на місці протягом дня. Якщо рішення позитивне, то власнику машини видаються номера, наклейки і паспорт тех. кошти з терміном дії. Ваш технічний паспорт буде виданий протягом 30 робочих днів.",
            questionFirst: 'Як відбувається рєстрація авто з вами?',
            answerFirst: 'Ми займаємося повним супровідом від початку до получення технічного паспорту',
        },
        {   
            id: 9,
            title: 'Нерухомість',
            photo: 'img/real.jpeg',
            offers: [
                {title: 'Допомога в отриманні іпотечного кредиту. ', deskription: 'Наші партнери гарантують Вам повний безкоштовний супровід в отриманні іпотечного кредиту (тільки для наших клієнтів). '},
                {title: 'Послуги ріелтора.', deskription: "Для тих, хто планує виїхати в Польщу на навчання, на роботу або на постійне місце проживання, виникає питання оренди житла. Наша команда надає Вам можливість знайти ідеальний варіант житла, який підійде і по бюджету, і за запитами."},
                {title: 'реєстрація на отримання пластіку', deskription: 'реєстрація та отримання карти разом з нашим працівником'},
                {title: "Отримання спадщини", deskription: 'Допомога в оформленні заяви про прийняття спадщини за місцем відкриття спадщини.'},
            ],
            deskription: ' Якщо ви хочете купити / продати чи здати в оренду свою нерухомість - пропонуємо вам скористатися послугами нашої компанії. Наші менеджери допоможуть вам обрати найвигідніші пропозиції, актуальні для ринку нерухомості сьогодні.',
            questionFirst: 'Ви допомогаєте в отриманні іпотечного кредиту?',
            answerFirst: 'Наші партнери гарантують Вам повний безкоштовний супровід в отриманні іпотечного кредиту (тільки для наших клієнтів).',
        },
        {   
            id: 10,
            title: 'інші послуги',
            photo: 'img/inni.jpeg',
            deskription: 'За індивідуальним зверненням клієнта, наші менеджери готові вирішують ваші питання та представляють ваші інтереси в органах місцевого самоврядування.',
            offers: [
                {title: 'Шлюб', deskription: 'Присяжний переклад, Подача заяви до суду, Розірвання шлюбу'},
                {title: 'Pesel.', deskription: "(Powszechny Elektroniczny System Ewidencji Ludności) -  це номер загальної системи електронного обліку населення, цифровий символ, що призначається фізичній особі та дозволяє ідентифікувати її.  PESEL налічує 11 цифр та містить інформацію про дату народження людини, її стать, порядковий номер та контрольний номер."},
                {title: 'PKK.', deskription: 'Профіль кандидата у водії – набір даних, які ідентифікують особу, яка хоче отримати водійські права. На підставі КК визнають кандидата у водії контори, автошколи, та інші установи, які беруть участь у процесі отримання водійських прав.'},
                {title: "Статус UKR", deskription: "Відкриття банківського рахунку стане в нагоді для іноземців, котрі планують довгострокове перебування на території Республіки Польща. Докладнішу інформацію ви можете отримати в наших спеціалістів"},
                {title: "Відкриття банківського рахунку", deskription: "Відкриття банківського рахунку стане в нагоді для іноземців, котрі планують довгострокове перебування на території Республіки Польща. Докладнішу інформацію ви можете отримати в наших спеціалістів."}
            ],        
        },
    ],
    offersActiveItem: {   
        id: 1,
        title: 'Тимчасовий побит',
        photo: 'img/pobyt.jpeg',
        deskription: 'Карта побиту. Це документ, що підтверджує особу та офіційний статус (тимчасовий або сталий) на території  Польщі. Карта побиту дає можливість легально знаходитись на території Польщі та зоні ЄС без оформлення та продовження візи. Дозвіл на перебування дозволяє його власнику - відкривати бізнес, оформлювати кредит та іпотеку, реєструвати на своє ім’я авто чи нерухомість. В залежності від типу, дозвіл на перебування іноземця оформлюється строком: до 3-х років (тимчасовий) та до 10-ти років (сталий побит, карта резидента).',
        questionFirst: 'Що дає тимчасовий побут?',
        answerFirst: "Дає право безперервно перебувати в країні і офіційно працювати строком від  1 до  3 років (в залежності від терміну виданого рішення). Видається на підставі робочого контракту, навчання чи возз'єднання з родиною",
        questionSecond: 'Як відбувається процес отримання дозволу на проживання за допомогою нашої фірми?',
        answerSecond: 'Безкоштовна консультація. Ви - задаєте всі питання, які вас турбують, ми - надаємо професійну оцінку вашій ситуації. Заключення контракту. Прозорий та покроковий план дій для кожного з клієнтів. Оплата. Після підписання контракту - ваш менеджер видає вам підтвердження оплати. Подача документів до органів місцевого самоврядування. Отримання децизії. Отримання пластикової ID карти. Наш менеджер зареєструє для вас зручний час, для отримання вашої карти побуту',
    },
}

const offersReducer = (state = initialState, action) => {
    let newState;
    switch(action.type) {
        case UPDATE_OFFERS:
            newState = {...state}
                initialState.offerItems.forEach((el) => {
                    if(el.id === action.activeOffersItem){
                        newState.offersActiveItem = el
                    }
                })
            return newState
        default:
            return state
    }
}

export const UpdateOffersActionCreator = (id) => {
    return ({
        type: UPDATE_OFFERS,
        activeOffersItem: id,
    })
}

export default offersReducer;